##  Managers with at Least 5 Direct Reports Leetcode Task25

In [27]:
import pandas as pd
import numpy as np

In [191]:
data = [['2020-12-8', 'toyota', 0, 1], ['2020-12-8', 'toyota', 1, 0], ['2020-12-8', 'toyota', 1, 2], ['2020-12-7', 'toyota', 0, 2], ['2020-12-7', 'toyota', 0, 1], ['2020-12-8', 'honda', 1, 2], ['2020-12-8', 'honda', 2, 1], ['2020-12-7', 'honda', 0, 1], ['2020-12-7', 'honda', 1, 2], ['2020-12-7', 'honda', 2, 1]]
DailySales = pd.DataFrame(data, columns=['date_id', 'make_name', 'lead_id', 'partner_id']).astype({'date_id':'datetime64[ns]', 'make_name':'object', 'lead_id':'Int64', 'partner_id':'Int64'})

In [192]:
DailySales

     date_id make_name  lead_id  partner_id
0 2020-12-08    toyota        0           1
1 2020-12-08    toyota        1           0
2 2020-12-08    toyota        1           2
3 2020-12-07    toyota        0           2
4 2020-12-07    toyota        0           1
5 2020-12-08     honda        1           2
6 2020-12-08     honda        2           1
7 2020-12-07     honda        0           1
8 2020-12-07     honda        1           2
9 2020-12-07     honda        2           1

In [198]:
df1 = DailySales.groupby(['date_id', 'make_name'])['lead_id'].nunique().reset_index(name='unique_leads')
df1

     date_id make_name  unique_leads
0 2020-12-07     honda             3
1 2020-12-07    toyota             1
2 2020-12-08     honda             2
3 2020-12-08    toyota             2

In [200]:
df2 = DailySales.groupby(['date_id', 'make_name'])['partner_id'].nunique().reset_index(name='unique_partners')
df2

     date_id make_name  unique_partners
0 2020-12-07     honda                2
1 2020-12-07    toyota                2
2 2020-12-08     honda                2
3 2020-12-08    toyota                3

In [201]:
df1.merge(df2 , on=['date_id','make_name'])

     date_id make_name  unique_leads  unique_partners
0 2020-12-07     honda             3                2
1 2020-12-07    toyota             1                2
2 2020-12-08     honda             2                2
3 2020-12-08    toyota             2                3